# Heroes Of Pymoli Data Analysis

## Background

Congratulations! After a lot of hard work in the data munging mines, you've landed a job as Lead Analyst for an independent gaming company. You've been assigned the task of analyzing the data for their most recent fantasy game Heroes of Pymoli.
Like many others in its genre, the game is free-to-play, but players are encouraged to purchase optional items that enhance their playing experience. As a first task, the company would like you to generate a report that breaks down the game's purchasing data into meaningful insights.

## Results

* The majority of players are male (84%) in the 20-24 age range

* The most popular game is Final Critic, which brought in a profit of $59.99

* Though males make more purchases than females, the average purchase price for females is 40 cents more than males, with an average purchase price of $4.46

In [1]:
# set up dependencies
import pandas as pd

# path to file
csv_path = "../Resources/city.csv"

In [2]:
# read
city_df = pd.read_csv(csv_path)
city_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [3]:
# player count
# list total number of players
unique_players_df = city_df["SN"].nunique()
print("Number of players :", (unique_players_df))

Number of players : 576

In [4]:
# purchasing analysis
# number of unique items
unique_items_df = city_df["Item ID"].nunique()
print('Unique items :', (unique_items_df))

Unique items : 179

In [5]:
# find average price
average_price_df = city_df["Price"].mean()
print('Average Price :' , (average_price_df))

Average Price : 3.050987179487176

In [6]:
# total purchases 780
total_purchases_df = city_df.shape[0]
print('Total Purchases: ', (total_purchases_df))

Total Purchases:  780

In [7]:
# total revenue 2379.77
total_revenue_df = city_df["Price"].sum()
print('Total Revenue: ', (total_revenue_df))

Total Revenue:  2379.77

In [8]:
# Create purchase data dataframe
purchase_analysis_df = pd.DataFrame({"Number of Unique Items": [unique_items_df], "Average Price":
                                    [average_price_df], "Total Purchases": [total_purchases_df],
                                    "Total Revenue": [total_revenue_df]})
purchase_analysis_df

   Number of Unique Items  Average Price  Total Purchases  Total Revenue
0                     179       3.050987              780        2379.77

In [9]:
# Gender demographics
# count of players
gender_count_df = city_df.groupby("Gender")["SN"].nunique()
gender_count_df.head()

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: SN, dtype: int64

In [10]:
# percentages
percentages_df = ((gender_count_df/unique_players_df) * 100).round(2)
percentages_df

Gender
Female                   14.06
Male                     84.03
Other / Non-Disclosed     1.91
Name: SN, dtype: float64

In [11]:
# create gender dataframe
gender_demographics_df = pd.DataFrame({"Total Count":gender_count_df, "Percentage of Players": 
                                      percentages_df})
gender_demographics_df

                       Total Count  Percentage of Players
Gender
Female                          81                  14.06
Male                           484                  84.03
Other / Non-Disclosed           11                   1.91

In [12]:
# gender purchases

gender_purchases_df = city_df.groupby("Gender")["Item Name"].count()
gender_purchases_df

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Item Name, dtype: int64

In [13]:
# gender purchases
gender_average_df = city_df.groupby("Gender")["Price"].mean()
gender_average_df.round(2)

Gender
Female                   3.20
Male                     3.02
Other / Non-Disclosed    3.35
Name: Price, dtype: float64

In [14]:
# total price by gender
gender_total_price_df = city_df.groupby("Gender")["Price"].sum()
gender_total_price_df.round(2)

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [15]:
# per person
normalized_gender_total_df = gender_total_price_df/gender_count_df
normalized_gender_total_df.round(2)

Gender
Female                   4.47
Male                     4.07
Other / Non-Disclosed    4.56
dtype: float64

In [16]:
gender_purchases_df = pd.DataFrame({"Purchase Count": gender_purchases_df, "Average Purchase Price": 
                                      gender_average_df, "Total Purchase Value": gender_total_price_df, "Avg per Person": normalized_gender_total_df})
gender_purchases_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg per Person
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

In [17]:
# age demographics
bins = [0,9.9,14.9,19.9,24.9,29.9,34.9,39.9,99999]
group_names = ["<10","10-14","15-19","20-24","25-29","30-34","35-39","40+"]
city_df["Age Summary"] = pd.cut(city_df["Age"], bins, labels = group_names, include_lowest = True)
city_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Summary
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24
778,778,Sisur91,7,Male,92,Final Critic,4.19,<10
779,779,Ennrian78,24,Male,50,Dawn,4.60,20-24

In [18]:
agegroup_purchase = city_df.groupby("Age Summary")["SN"].count()
agegroup_purchase

Age Summary
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: SN, dtype: int64

In [19]:
agegroup_purchase_average = city_df.groupby("Age Summary")["Price"].mean()
agegroup_purchase_average.round(2)

Age Summary
<10      3.35
10-14    2.96
15-19    3.04
20-24    3.05
25-29    2.90
30-34    2.93
35-39    3.60
40+      2.94
Name: Price, dtype: float64

In [20]:
agegroup_purchase_total = city_df.groupby("Age Summary")["Price"].sum()
agegroup_purchase_total

Age Summary
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [21]:
agegroup_purchase_unique = city_df.groupby("Age Summary")["SN"].nunique()
agegroup_purchase_unique

Age Summary
<10       17
10-14     22
15-19    107
20-24    258
25-29     77
30-34     52
35-39     31
40+       12
Name: SN, dtype: int64

In [22]:
normalized_purchases =agegroup_purchase_total/agegroup_purchase_unique
normalized_purchases

Age Summary
<10      4.537059
10-14    3.762727
15-19    3.858785
20-24    4.318062
25-29    3.805195
30-34    4.115385
35-39    4.763548
40+      3.186667
dtype: float64

In [23]:
purchase_analysis_age_df = pd.DataFrame({"Purchase Count": agegroup_purchase_total, "Average Purchase Price": agegroup_purchase_average, 
                                     "Total Purchase Value": agegroup_purchase_total, "Avg Total per Person": normalized_purchases})
purchase_analysis_age_df

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total per Person
Age Summary,,,,
<10,77.13,3.353478,77.13,4.537059
10-14,82.78,2.956429,82.78,3.762727
15-19,412.89,3.035956,412.89,3.858785
20-24,1114.06,3.052219,1114.06,4.318062
25-29,293.00,2.900990,293.00,3.805195
30-34,214.00,2.931507,214.00,4.115385
35-39,147.67,3.601707,147.67,4.763548
40+,38.24,2.941538,38.24,3.186667

In [24]:
# total amount players have spent
top_spenders_df = city_df.groupby("SN")["Price"].sum()
top_spenders_df

SN
Adairialis76     2.28
Adastirin33      4.48
Aeda94           4.91
Aela59           4.32
Aelaria33        1.79
                 ...
Yathecal82       6.22
Yathedeu43       6.02
Yoishirrala98    4.58
Zhisrisu83       7.89
Zontibe81        8.03
Name: Price, Length: 576, dtype: float64

In [25]:
# Average amount spent by player
top_spender_average = city_df.groupby("SN")["Price"].mean()
top_spender_average

SN
Adairialis76     2.280000
Adastirin33      4.480000
Aeda94           4.910000
Aela59           4.320000
Aelaria33        1.790000
                   ...
Yathecal82       2.073333
Yathedeu43       3.010000
Yoishirrala98    4.580000
Zhisrisu83       3.945000
Zontibe81        2.676667
Name: Price, Length: 576, dtype: float64

In [26]:
# count of purchases by player
top_spender_count = city_df.groupby("SN")["Price"].count()
top_spender_count

SN
Adairialis76     1
Adastirin33      1
Aeda94           1
Aela59           1
Aelaria33        1
                ..
Yathecal82       3
Yathedeu43       2
Yoishirrala98    1
Zhisrisu83       2
Zontibe81        3
Name: Price, Length: 576, dtype: int64

In [29]:
# Create dataframe
top_spender_df = pd.DataFrame({"Count of Purchases": top_spender_count, "Average Purchase Price": top_spender_average, 
                                     "Total Purchase Value": top_spenders_df})
top_spender_df.sort_values("Total Purchase Value", ascending=False).head(5)

             Count of Purchases  Average Purchase Price  Total Purchase Value
SN
Lisosia93                     5                3.792000                 18.96
Idastidru52                   4                3.862500                 15.45
Chamjask73                    3                4.610000                 13.83
Iral74                        4                3.405000                 13.62
Iskadarya95                   3                4.366667                 13.10

In [31]:
# popular items
popular_total = city_df.groupby(["Item ID","Item Name"])["Price"].count().rename("Purchase Count")
popular_items = pd.DataFrame(popular_total)
popular_items.sort_values("Purchase Count", ascending=False).head(5)

                                                      Purchase Count
Item ID Item Name
92      Final Critic                                              13
178     Oathbreaker, Last Hope of the Breaking Storm              12
145     Fiery Glass Crusader                                       9
132     Persuasion                                                 9
108     Extraction, Quickblade Of Trembling Hands                  9

In [35]:
pop_test = city_df.groupby(["Item ID", "Item Name"]).sum()[["Price"]]

In [36]:
combined_pop = pd.merge(pop_test, popular_total, on=["Item ID", "Item Name"], how="left")
combined_pop
combined_pop.sort_values("Purchase Count", ascending=False).head(5)

                                                      Price  Purchase Count
Item ID Item Name
92      Final Critic                                  59.99              13
178     Oathbreaker, Last Hope of the Breaking Storm  50.76              12
145     Fiery Glass Crusader                          41.22               9
132     Persuasion                                    28.99               9
108     Extraction, Quickblade Of Trembling Hands     31.77               9

In [37]:
pop_test = city_df.groupby(["Item ID", "Item Name"]).sum()["Price"]
item_price = pd.DataFrame(pop_test/popular_total)
item_price

                                                           0
Item ID Item Name
0       Splinter                                      1.2800
1       Crucifer                                      2.9425
2       Verdict                                       2.4800
3       Phantomlight                                  2.4900
4       Bloodlord's Fetish                            1.7000
...                                                      ...
178     Oathbreaker, Last Hope of the Breaking Storm  4.2300
179     Wolf, Promise of the Moonwalker               4.4800
181     Reaper's Toll                                 1.6600
182     Toothpick                                     4.0300
183     Dragon's Greatsword                           1.0900

[179 rows x 1 columns]

In [48]:
# Most popular items display
combine_data = pd.merge(item_price, combined_pop, on=["Item ID", "Item Name"], how="left")
combine_data = combine_data.rename(columns={0:"Item Price"})
combine_data.sort_values("Purchase Count", ascending=False).head(5)

,,Item Price,Price,Purchase Count
Item ID,Item Name,,,
92,Final Critic,4.614615,59.99,13
178,"Oathbreaker, Last Hope of the Breaking Storm",4.230000,50.76,12
145,Fiery Glass Crusader,4.580000,41.22,9
132,Persuasion,3.221111,28.99,9
108,"Extraction, Quickblade Of Trembling Hands",3.530000,31.77,9

In [50]:
# Most profitable items display
combine_data = pd.merge(item_price, combined_pop, on=["Item ID", "Item Name"], how="left")
combine_data = combine_data.rename(columns={0:"Item Price"})
combine_data.sort_values("Price", ascending=False).head(5)

,,Item Price,Price,Purchase Count
Item ID,Item Name,,,
92,Final Critic,4.614615,59.99,13
178,"Oathbreaker, Last Hope of the Breaking Storm",4.230000,50.76,12
82,Nirvana,4.900000,44.10,9
145,Fiery Glass Crusader,4.580000,41.22,9
103,Singed Scalpel,4.350000,34.80,8